Reports/АР17_РеестрДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>АР17_РеестрДоговоров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ВидыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/АР_СобственникиОбъектовАренды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АР_СобственникиОбъектовАренды</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АгентскаяСхема</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/АР_СтатусДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>АР_СтатусДоговора</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подписан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодписанСкан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/АР_АктПриемаПередачиПомещенияВАренду.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>АР_АктПриемаПередачиПомещенияВАренду</Name>
			<BasedOn>
				<xr:Item>Document.АР17_ЗаключениеДоговораАренды</xr:Item>
				<xr:Item>Document.АР17_ДополнительноеСоглашение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.АР_ПереданныеДокументы</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>InformationRegister.АР_СтатусыОбъектовНедвижимости</xr:Item>
				<xr:Item>InformationRegister.АР_СостояниеОбъектов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация-арендодатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьПроводки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаБУ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеДоговораАренды</v8:Type>
						<v8:Type>cfg:DocumentRef.АР17_ДополнительноеСоглашение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Передан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Возвращен</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АР_Москва</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АР_СанктПетербург</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АР_СтатусДоговора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектАренды</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Площадь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/АР17_РеестрДоговоров/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПоказатьНастройки(Команда)
	
	Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость = НЕ ЭтотОбъект.ПоказатьНастройки;
	ЭтотОбъект.ПоказатьНастройки = НЕ ЭтотОбъект.ПоказатьНастройки;
	
	Если ЭтотОбъект.ПоказатьНастройки Тогда
		Элементы.ПоказатьНастройки.Заголовок = "Скрыть настройки";
	Иначе
		Элементы.ПоказатьНастройки.Заголовок = "Показать настройки";
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтотОбъект.ПоказатьНастройки = Истина;
	//Элементы.ПоказатьНастройки.Заголовок = "Скрыть настройки";
	ЭтотОбъект.Отчет.Статус = "Текущие";
	Статус1 = "Текущие";
КонецПроцедуры



&НаСервере
Процедура СформироватьНаСервере()
	ТД = Элементы.ТД;//ЭлементыФормы.ТД;
	ТД.Очистить();
	//Макет = Отчеты.АР17_ОтчетАгентаФинансовыеПоказатели.ПолучитьМакет("Макет");
	Макет = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("Макет");
	Область = Макет.ПолучитьОбласть("Шапка_");
	ТД.Вывести(Область);

	Область = Макет.ПолучитьОбласть("Шапка");
	ТД.Вывести(Область);
	
	ТабРезультат = Новый ТаблицаЗначений;
	
    КЧ = Новый КвалификаторыЧисла(12,2);
    КД = Новый КвалификаторыДаты(ЧастиДаты.Дата);
    КС = Новый КвалификаторыСтроки(20);
    Массив = Новый Массив;
    Массив.Добавить(Тип("Число"));
    ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
    Массив.Очистить();
    Массив.Добавить(Тип("Дата"));
    ОписаниеТиповД = Новый ОписаниеТипов(Массив, , ,КД);
	Массив.Очистить();
	Массив.Добавить(Тип("Строка"));
    ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	ТабРезультат.Колонки.Добавить("ОбеспечительныйВзнос",ОписаниеТиповЧ);
	ТабРезультат.Колонки.Добавить("Ставка",ОписаниеТиповЧ);
	ТабРезультат.Колонки.Добавить("Контрагент",Новый описаниеТипов("СправочникСсылка.Контрагенты"));
	ТабРезультат.Колонки.Добавить("Договор",Новый описаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ТабРезультат.Колонки.Добавить("ДатаОкончанияСрокаАренды", ОписаниеТиповД);
	ТабРезультат.Колонки.Добавить("ДатаНачалаСрокаАренды", ОписаниеТиповД);    
	ТабРезультат.Колонки.Добавить("ДатаАкта", ОписаниеТиповД);           
	//ТабРезультат.Колонки.Добавить("Организация",Новый описаниеТипов("СправочникСсылка.Организации"));
	ТабРезультат.Колонки.Добавить("ВидДоговора",Новый описаниеТипов("СправочникСсылка.АР_ВидыДоговоров"));
	ТабРезультат.Колонки.Добавить("Комментарий",ОписаниеТиповС);
	ТабРезультат.Колонки.Добавить("ПлощадьПоДоговору",ОписаниеТиповЧ);
	ТабРезультат.Колонки.Добавить("Номенклатура",Новый описаниеТипов("СправочникСсылка.Номенклатура"));
	ТабРезультат.Колонки.Добавить("Этаж",Новый описаниеТипов("СправочникСсылка.АР_ОбъектыАренды"));
	ТабРезультат.Колонки.Добавить("Офис",Новый описаниеТипов("СправочникСсылка.АР_ОбъектыАренды"));
	ТабРезультат.Колонки.Добавить("Помещение",Новый описаниеТипов("СправочникСсылка.АР_ОбъектыАренды"));
	ТабРезультат.Колонки.Добавить("Здание",Новый описаниеТипов("СправочникСсылка.АР_ОбъектыАренды"));
	ТабРезультат.Колонки.Добавить("Объект",Новый описаниеТипов("СправочникСсылка.АР_ОбъектыАренды"));
	ТабРезультат.Колонки.Добавить("Валюта",Новый описаниеТипов("СправочникСсылка.Валюты"));
	ТабРезультат.Колонки.Добавить("СтоимостьПоНоменклатуре", ОписаниеТиповЧ);
	ТабРезультат.Колонки.Добавить("СуммаДоговора", ОписаниеТиповЧ);
	ТабРезультат.Колонки.Добавить("РазмерПоБТИ", ОписаниеТиповЧ);
	ТабРезультат.Колонки.Добавить("РазмерПоБома", ОписаниеТиповЧ);
	ТабРезультат.Колонки.Добавить("НазваниеБренд",ОписаниеТиповС);
	ТабРезультат.Колонки.Добавить("НомерПоПлану", ОписаниеТиповС);
	ТабРезультат.Колонки.Добавить("ИК",Новый ОписаниеТипов("СправочникСсылка.АР_ОбъектыАренды"));
	ТабРезультат.Колонки.Добавить("Профиль",ОписаниеТиповС);
	ТабРезультат.Колонки.Добавить("ОдностороннееРасторжениеСоСтороныАрендодателя",ОписаниеТиповС);
	ТабРезультат.Колонки.Добавить("ОдностороннееРасторжениеСоСтороныАрендатора",ОписаниеТиповС);
	//ТабРезультат.Колонки.Добавить("Арендодатель",Новый описаниеТипов("СправочникСсылка.Контрагенты"));
	ТабРезультат.Колонки.Добавить("Организация",Новый описаниеТипов("СправочникСсылка.Организации"));
	ТабРезультат.Колонки.Добавить("Индексация",ОписаниеТиповС);
	ТабРезультат.Колонки.Добавить("USD",ОписаниеТиповС);
	ТабРезультат.Колонки.Добавить("ЦенаКвМГод",ОписаниеТиповС);
	ТабРезультат.Колонки.Добавить("Номер",ОписаниеТиповС);
	ТабРезультат.Колонки.Добавить("ФактическоеНачало", ОписаниеТиповД);
	ТабРезультат.Колонки.Добавить("ФактическоеОкончание", ОписаниеТиповД);    
	
	ТабРезультат.Колонки.Добавить("Ссылка",Новый описаниеТипов("ДокументСсылка.АР17_ЗаключениеДоговораАренды"));
	ТабРезультат.Колонки.Добавить("СуммаЗалога", ОписаниеТиповЧ);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(ВложенныйЗапрос.ДокументДата) КАК ДокументДата,
		|	ВложенныйЗапрос.ДокументСсылка КАК ДокументСсылка,
		|	ВложенныйЗапрос.Ссылка КАК Ссылка,
		|	ВложенныйЗапрос.СуммаЗалога КАК СуммаЗалога,
		|	ВложенныйЗапрос.ОбщаяПлощадь КАК ОбщаяПлощадь
		|ИЗ
		|	(ВЫБРАТЬ
		|		МАКСИМУМ(АР_ЗаключениеДоговораАрендыДополнительныеСоглашения.Документ.Дата) КАК ДокументДата,
		|		АР_ЗаключениеДоговораАрендыДополнительныеСоглашения.Документ.Ссылка КАК ДокументСсылка,
		|		АР_ЗаключениеДоговораАрендыДополнительныеСоглашения.Ссылка КАК Ссылка,
		|		АР_ЗаключениеДоговораАрендыДополнительныеСоглашения.Ссылка.ФактическоеНачало КАК ФактическоеНачало,
		|		АР_ЗаключениеДоговораАрендыДополнительныеСоглашения.Ссылка.ФактическоеОкончание КАК ФактическоеОкончание,
		|		NULL КАК СуммаЗалога,
		|		NULL КАК ОбщаяПлощадь
		|	ИЗ
		|		Документ.АР17_ЗаключениеДоговораАренды.ДополнительныеСоглашения КАК АР_ЗаключениеДоговораАрендыДополнительныеСоглашения
		|	ГДЕ
		|		ВЫБОР
		|				КОГДА &Статус <> ""Закрытые""
		|						И &Статус <> ""Текущие""
		|					ТОГДА АР_ЗаключениеДоговораАрендыДополнительныеСоглашения.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|				ИНАЧЕ ВЫБОР
		|						КОГДА &Статус = ""Закрытые""
		|							ТОГДА АР_ЗаключениеДоговораАрендыДополнительныеСоглашения.Ссылка.ФактическоеОкончание <= &ДатаКон
		|									И АР_ЗаключениеДоговораАрендыДополнительныеСоглашения.Ссылка.ФактическоеОкончание >= &ДатаНач
		|						ИНАЧЕ ВЫБОР
		|								КОГДА &Статус = ""Текущие""
		|									ТОГДА (АР_ЗаключениеДоговораАрендыДополнительныеСоглашения.Ссылка.ФактическоеОкончание >= &ДатаКон
		|											ИЛИ АР_ЗаключениеДоговораАрендыДополнительныеСоглашения.Ссылка.ФактическоеОкончание = ДАТАВРЕМЯ(1, 1, 1))
		|											И АР_ЗаключениеДоговораАрендыДополнительныеСоглашения.Ссылка.СтатусДоговора = ЗНАЧЕНИЕ(Перечисление.АР_СтатусДоговора.Согласован)
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	
		|	СГРУППИРОВАТЬ ПО
		|		АР_ЗаключениеДоговораАрендыДополнительныеСоглашения.Документ.Ссылка,
		|		АР_ЗаключениеДоговораАрендыДополнительныеСоглашения.Ссылка,
		|		АР_ЗаключениеДоговораАрендыДополнительныеСоглашения.Ссылка.ФактическоеНачало,
		|		АР_ЗаключениеДоговораАрендыДополнительныеСоглашения.Ссылка.ФактическоеОкончание
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка.Дата,
		|		АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка,
		|		АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка,
		|		АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка.ФактическоеНачало,
		|		АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка.ФактическоеОкончание,
		|		МАКСИМУМ(АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка.СуммаЗалога),
		|		СУММА(АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Количество)
		|	ИЗ
		|		Документ.АР17_ЗаключениеДоговораАренды.ПостояннаяЧастьАренднойПлаты КАК АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты
		|	ГДЕ
		|		ВЫБОР
		|				КОГДА &Статус <> ""Закрытые""
		|						И &Статус <> ""Текущие""
		|					ТОГДА АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|				ИНАЧЕ ВЫБОР
		|						КОГДА &Статус = ""Закрытые""
		|							ТОГДА АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка.ФактическоеОкончание <= &ДатаКон
		|									И АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка.ФактическоеОкончание >= &ДатаНач
		|						ИНАЧЕ ВЫБОР
		|								КОГДА &Статус = ""Текущие""
		|									ТОГДА (АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка.ФактическоеОкончание >= &ДатаКон
		|											ИЛИ АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка.ФактическоеОкончание = ДАТАВРЕМЯ(1, 1, 1))
		|											И АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка.СтатусДоговора = ЗНАЧЕНИЕ(Перечисление.АР_СтатусДоговора.Согласован)
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	
		|	СГРУППИРОВАТЬ ПО
		|		АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка.Дата,
		|		АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка,
		|		АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка.ФактическоеНачало,
		|		АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка.ФактическоеОкончание,
		|		АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка.Дата,
		|		АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка,
		|		АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка,
		|		АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка.ФактическоеНачало,
		|		АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка.ФактическоеОкончание,
		|		МАКСИМУМ(АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка.СуммаЗалога),
		|		СУММА(АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Количество)
		|	ИЗ
		|		Документ.АР17_ЗаключениеДоговораАренды.ПеременнаяЧастьАренднойПлаты КАК АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты
		|	ГДЕ
		|		ВЫБОР
		|				КОГДА &Статус <> ""Закрытые""
		|						И &Статус <> ""Текущие""
		|					ТОГДА АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|				ИНАЧЕ ВЫБОР
		|						КОГДА &Статус = ""Закрытые""
		|							ТОГДА АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка.ФактическоеОкончание <= &ДатаКон
		|									И АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка.ФактическоеОкончание >= &ДатаНач
		|						ИНАЧЕ ВЫБОР
		|								КОГДА &Статус = ""Текущие""
		|									ТОГДА (АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка.ФактическоеОкончание >= &ДатаКон
		|											ИЛИ АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка.ФактическоеОкончание = ДАТАВРЕМЯ(1, 1, 1))
		|											И АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка.СтатусДоговора = ЗНАЧЕНИЕ(Перечисление.АР_СтатусДоговора.Согласован)
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	
		|	СГРУППИРОВАТЬ ПО
		|		АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка.Дата,
		|		АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка,
		|		АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка.ФактическоеНачало,
		|		АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка.ФактическоеОкончание,
		|		АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.ДокументСсылка,
		|	ВложенныйЗапрос.Ссылка,
		|	ВложенныйЗапрос.СуммаЗалога,
		|	ВложенныйЗапрос.ОбщаяПлощадь";
	
	 
	Запрос.УстановитьПараметр("ДатаНач",Отчет.НачалоПериода);
	Запрос.УстановитьПараметр("ДатаКон",КонецДня(Отчет.КонецПериода));
	Запрос.УстановитьПараметр("Статус",Отчет.Статус);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		//Если ТипЗнч(ВыборкаДетальныеЗаписи.ДокументСсылка) = Тип("ДокументСсылка.АР17_ЗаключениеДоговораАренды") Тогда
		//	ПутьКИК = "";
		//Иначе
		//	ПутьКИК = ".ДокументОснование";
		//КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПоследнийДокПостояннаяЧастьАренднойПлаты.ОбъектАренды КАК ОбъектАренды,
		|	ПоследнийДокПостояннаяЧастьАренднойПлаты.Услуга КАК Услуга,
		|	СУММА(ПоследнийДокПостояннаяЧастьАренднойПлаты.Количество) КАК Количество,
		|	СУММА(ВЫРАЗИТЬ(ПоследнийДокПостояннаяЧастьАренднойПлаты.Ставка КАК ЧИСЛО(15, 2))) КАК Ставка,
		|	ПоследнийДокПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды КАК ДатаНачалаСрокаАренды,
		|	ПоследнийДокПостояннаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды КАК ДатаОкончанияСрокаАренды,
		|	ПоследнийДокПостояннаяЧастьАренднойПлаты.Ссылка КАК Ссылка,
		|	ПоследнийДокПостояннаяЧастьАренднойПлаты.Ссылка.ФактическоеНачало КАК ФактическоеНачало,
		|	ПоследнийДокПостояннаяЧастьАренднойПлаты.Ссылка.ФактическоеОкончание КАК ФактическоеОкончание,
		|	ПоследнийДокПостояннаяЧастьАренднойПлаты.Ссылка.ИК КАК ИК,
		|	СУММА(ПоследнийДокПостояннаяЧастьАренднойПлаты.Ссылка.СуммаЗалога) КАК СуммаЗалога,
		|	СУММА(ПоследнийДокПостояннаяЧастьАренднойПлаты.Сумма) КАК Сумма,
		|	ПоследнийДокПостояннаяЧастьАренднойПлаты.Ссылка.Контрагент КАК Контрагент
		|ПОМЕСТИТЬ ТабДоговоров
		|ИЗ
		|	Документ.АР17_ЗаключениеДоговораАренды.ПостояннаяЧастьАренднойПлаты КАК ПоследнийДокПостояннаяЧастьАренднойПлаты
		|ГДЕ
		|	ПоследнийДокПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды <= &ДатаКон
		|	И ПоследнийДокПостояннаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды >= &ДатаНач
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоследнийДокПостояннаяЧастьАренднойПлаты.Услуга,
		|	ПоследнийДокПостояннаяЧастьАренднойПлаты.Ссылка,
		|	ПоследнийДокПостояннаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды,
		|	ПоследнийДокПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды,
		|	ПоследнийДокПостояннаяЧастьАренднойПлаты.ОбъектАренды,
		|	ПоследнийДокПостояннаяЧастьАренднойПлаты.Ссылка.ФактическоеНачало,
		|	ПоследнийДокПостояннаяЧастьАренднойПлаты.Ссылка.ФактическоеОкончание,
		|	ПоследнийДокПостояннаяЧастьАренднойПлаты.Ссылка.ИК,
		|	ПоследнийДокПостояннаяЧастьАренднойПлаты.Ссылка.Контрагент
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПоследнийДокПеременнаяЧастьАренднойПлаты.ОбъектАренды,
		|	ПоследнийДокПеременнаяЧастьАренднойПлаты.Услуга,
		|	СУММА(ПоследнийДокПеременнаяЧастьАренднойПлаты.Количество),
		|	СУММА(ВЫРАЗИТЬ(ПоследнийДокПеременнаяЧастьАренднойПлаты.Ставка КАК ЧИСЛО(15, 2))),
		|	ПоследнийДокПеременнаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды,
		|	ПоследнийДокПеременнаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды,
		|	ПоследнийДокПеременнаяЧастьАренднойПлаты.Ссылка,
		|	ПоследнийДокПеременнаяЧастьАренднойПлаты.Ссылка.ФактическоеНачало,
		|	ПоследнийДокПеременнаяЧастьАренднойПлаты.Ссылка.ФактическоеОкончание,
		|	ПоследнийДокПеременнаяЧастьАренднойПлаты.Ссылка.ИК,
		|	СУММА(ПоследнийДокПеременнаяЧастьАренднойПлаты.Ссылка.СуммаЗалога),
		|	СУММА(ПоследнийДокПеременнаяЧастьАренднойПлаты.Сумма),
		|	ПоследнийДокПеременнаяЧастьАренднойПлаты.Ссылка.Контрагент
		|ИЗ
		|	Документ.АР17_ЗаключениеДоговораАренды.ПеременнаяЧастьАренднойПлаты КАК ПоследнийДокПеременнаяЧастьАренднойПлаты
		|ГДЕ
		|	ПоследнийДокПеременнаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды <= &ДатаКон
		|	И ПоследнийДокПеременнаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды >= &ДатаНач
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоследнийДокПеременнаяЧастьАренднойПлаты.Ссылка,
		|	ПоследнийДокПеременнаяЧастьАренднойПлаты.ОбъектАренды,
		|	ПоследнийДокПеременнаяЧастьАренднойПлаты.Услуга,
		|	ПоследнийДокПеременнаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды,
		|	ПоследнийДокПеременнаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды,
		|	ПоследнийДокПеременнаяЧастьАренднойПлаты.Ссылка.ФактическоеНачало,
		|	ПоследнийДокПеременнаяЧастьАренднойПлаты.Ссылка.ФактическоеОкончание,
		|	ПоследнийДокПеременнаяЧастьАренднойПлаты.Ссылка.ИК,
		|	ПоследнийДокПеременнаяЧастьАренднойПлаты.Ссылка.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка КАК Ссылка,
		|	СУММА(АР17_ЗаключениеДоговораАрендыОбъектыАренды.Площадь) КАК Количество
		|ПОМЕСТИТЬ втПлощадь
		|ИЗ
		|	Документ.АР17_ЗаключениеДоговораАренды.ОбъектыАренды КАК АР17_ЗаключениеДоговораАрендыОбъектыАренды
		|ГДЕ
		|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1)
		|
		|СГРУППИРОВАТЬ ПО
		|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТабДоговоров.Ссылка.Организация КАК Организация,
		|	ТабДоговоров.Ссылка.Контрагент КАК Контрагент,
		|	ТабДоговоров.Ссылка.ДоговорКонтрагента КАК Договор,
		|	МАКСИМУМ(АР_АктПриемаПередачиПомещенияВАренду.Дата) КАК ДатаАкта,
		|	ТабДоговоров.Услуга КАК Номенклатура,
		|	СУММА(ТабДоговоров.Количество) КАК Количество,
		|	ТабДоговоров.Сумма КАК СтоимостьПоНоменклатуре,
		|	ТабДоговоров.Ссылка КАК Ссылка,
		|	ТабДоговоров.ДатаНачалаСрокаАренды КАК ДатаНачалаСрокаАренды,
		|	ТабДоговоров.ДатаОкончанияСрокаАренды КАК ДатаОкончанияСрокаАренды,
		|	ВЫРАЗИТЬ(ТабДоговоров.Ссылка.Комментарий КАК СТРОКА(100)) КАК Комментарий,
		|	ТабДоговоров.Ссылка.ВидДоговора КАК ВидДоговора,
		|	ТабДоговоров.ИК КАК ИК,
		|	ТабДоговоров.СуммаЗалога КАК СуммаЗалога,
		|	"""" КАК НазваниеБренд,
		|	"""" КАК Профиль,
		|	ТабДоговоров.Ссылка.СуммаЗалога КАК ОбеспечительныйВзнос,
		|	ТабДоговоров.Ссылка.ВалютаДепозита КАК Валюта,
		|	"""" КАК ОдностороннееРасторжениеСоСтороныАрендатора,
		|	"""" КАК USD,
		|	"""" КАК Индексация,
		|	"""" КАК ЦенаКвМГод,
		|	ТабДоговоров.ФактическоеНачало КАК ФактическоеНачало,
		|	ТабДоговоров.ФактическоеОкончание КАК ФактическоеОкончание,
		|	"""" КАК ОдностороннееРасторжениеСоСтороныАрендодателя,
		|	ТабДоговоров.Ссылка.Номер КАК Номер,
		|	ТабДоговоров.Ставка КАК Ставка,
		|	ТабДоговоров.Количество КАК Количество1,
		|	втПлощадь.Количество КАК ПлощадьПоДоговору
		|ИЗ
		|	ТабДоговоров КАК ТабДоговоров
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР_АктПриемаПередачиПомещенияВАренду КАК АР_АктПриемаПередачиПомещенияВАренду
		|		ПО ТабДоговоров.Ссылка.ДоговорКонтрагента = АР_АктПриемаПередачиПомещенияВАренду.ДоговорКонтрагента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_СобственникиОбъектовАренды.СрезПоследних КАК АР_СобственникиОбъектовАрендыСрезПоследних
		|		ПО ТабДоговоров.ОбъектАренды = АР_СобственникиОбъектовАрендыСрезПоследних.ОбъектАренды
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПлощадь КАК втПлощадь
		|		ПО ТабДоговоров.Ссылка = втПлощадь.Ссылка
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &Статус <> ""Закрытые""
		|					И &Статус <> ""Текущие""
		|				ТОГДА ТабДоговоров.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|			ИНАЧЕ ВЫБОР
		|					КОГДА &Статус = ""Закрытые""
		|						ТОГДА ТабДоговоров.Ссылка.ФактическоеОкончание <= &ДатаНач
		|					ИНАЧЕ ВЫБОР
		|							КОГДА &Статус = ""Текущие""
		|								ТОГДА (ТабДоговоров.Ссылка.ФактическоеОкончание >= &ДатаКон
		|										ИЛИ ТабДоговоров.Ссылка.ФактическоеОкончание = ДАТАВРЕМЯ(1, 1, 1))
		|										И ТабДоговоров.Ссылка.СтатусДоговора = ЗНАЧЕНИЕ(Перечисление.АР_СтатусДоговора.Согласован)
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &Организация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|				ТОГДА ТабДоговоров.Ссылка.Организация = &Организация
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|				ТОГДА ТабДоговоров.Ссылка.Контрагент = &Контрагент
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ИК <> ЗНАЧЕНИЕ(Справочник.АР_ОбъектыАренды.ПустаяСсылка)
		|				ТОГДА ТабДоговоров.ИК = &ИК
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ВидДоговора <> ЗНАЧЕНИЕ(Справочник.АР_ВидыДоговоров.ПустаяСсылка)
		|				ТОГДА ТабДоговоров.Ссылка.ВидДоговора = &ВидДоговора
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ТабДоговоров.ФактическоеНачало,
		|	ТабДоговоров.ДатаОкончанияСрокаАренды,
		|	ТабДоговоров.ДатаНачалаСрокаАренды,
		|	ТабДоговоров.ИК,
		|	ТабДоговоров.Услуга,
		|	ТабДоговоров.ФактическоеОкончание,
		|	ТабДоговоров.Ссылка,
		|	ТабДоговоров.Ссылка.Организация,
		|	ТабДоговоров.Ссылка.Контрагент,
		|	ТабДоговоров.Ссылка.ДоговорКонтрагента,
		|	ТабДоговоров.Ссылка.ВидДоговора,
		|	ТабДоговоров.СуммаЗалога,
		|	ТабДоговоров.Ссылка.СуммаЗалога,
		|	ТабДоговоров.Ссылка.ВалютаДепозита,
		|	ТабДоговоров.Ссылка.Номер,
		|	ВЫРАЗИТЬ(ТабДоговоров.Ссылка.Комментарий КАК СТРОКА(100)),
		|	ТабДоговоров.Сумма,
		|	ТабДоговоров.Ставка,
		|	ТабДоговоров.Количество,
		|	втПлощадь.Количество
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация,
		|	ИК,
		|	Контрагент,
		|	Договор";
		
		Запрос.УстановитьПараметр("ДатаНач",Отчет.НачалоПериода);
		Запрос.УстановитьПараметр("ДатаКон",КонецДня(Отчет.КонецПериода));
		Запрос.УстановитьПараметр("Статус",Статус1);
		Запрос.УстановитьПараметр("Организация",Отчет.Организация);
		Запрос.УстановитьПараметр("Контрагент",Отчет.Контрагент);
		Запрос.УстановитьПараметр("ВидДоговора",Отчет.ВидДоговора);
		Запрос.УстановитьПараметр("ИК",Отчет.ИК);
		
		СтараяОрганизация = "";
		СтарыйКонтрагент = "";
		СтарыйИК = "";
		СтарыйДоговор = "";
		СтараяНоменклатура = "";
		
		Выгрузка = запрос.Выполнить().Выгрузить();
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл
			
			Если СтараяОрганизация <> РезультатЗапроса.Организация Тогда
				Область = Макет.ПолучитьОбласть("СтрОрганизация");
				Область.Параметры.Организация = РезультатЗапроса.Организация;
				ТД.Вывести(Область);
				СтараяОрганизация = РезультатЗапроса.Организация;
			КонецЕсли;	
			
			Если СтарыйИК <> РезультатЗапроса.ИК Тогда
				Область = Макет.ПолучитьОбласть("СтрИК");
				Область.Параметры.ИК = РезультатЗапроса.ИК;
				ТД.Вывести(Область);
				СтарыйИК = РезультатЗапроса.ИК;
			КонецЕсли;
			
			Если СтарыйКонтрагент <> РезультатЗапроса.Контрагент Тогда
				Область = Макет.ПолучитьОбласть("СтрКонтрагент");
				Область.Параметры.Контрагент = РезультатЗапроса.Контрагент;
				ТД.Вывести(Область);
				СтарыйКонтрагент = РезультатЗапроса.Контрагент;
			КонецЕсли;	
			
		 	Отбор = Новый Структура();
		    Отбор.Вставить("Ссылка", РезультатЗапроса.Ссылка);
		    Таблица2 = Выгрузка.Скопировать(Отбор);
			Таблица2.Свернуть("Номенклатура","Ставка,СтоимостьПоНоменклатуре");
			Таблица3 = Таблица2.Скопировать();
			Таблица3.Свернуть("СтоимостьПоНоменклатуре");
			
			Если СтарыйДоговор <> РезультатЗапроса.Ссылка Тогда
				
				Область = Макет.ПолучитьОбласть("СтрДоговор");
				Область.Параметры.Договор = РезультатЗапроса.Ссылка.Номер;
				Область.Параметры.ДатаАкта = Формат(РезультатЗапроса.ДатаАкта,"ДЛФ=Д");
				Область.Параметры.ВидДоговора = РезультатЗапроса.ВидДоговора;
				Область.Параметры.ПлощадьПоДоговору = РезультатЗапроса.ПлощадьПоДоговору;
				Область.Параметры.Ставка = Таблица2.Итог("Ставка");
				Область.Параметры.СуммаДоговора = Таблица3.Итог("СтоимостьПоНоменклатуре");
				Область.Параметры.СтоимостьПоНоменклатуре = Таблица2.Итог("СтоимостьПоНоменклатуре");
				Область.Параметры.ФактическоеНачало = Формат(РезультатЗапроса.ФактическоеНачало,"ДЛФ=Д");
				Область.Параметры.ФактическоеОкончание = Формат(РезультатЗапроса.ФактическоеОкончание,"ДЛФ=Д");
				Область.Параметры.Комментарий=РезультатЗапроса.Комментарий;
				Область.Параметры.Ссылка=РезультатЗапроса.Ссылка;
				ТД.Вывести(Область);
				
				СтараяНоменклатура = "";
				Для Каждого Стр2 Из Таблица2 Цикл
					Если СтараяНоменклатура <> Стр2.Номенклатура Тогда
						Область = Макет.ПолучитьОбласть("СтрНоменклатура");
						Область.Параметры.Ставка = Стр2.Ставка;
						Область.Параметры.СтоимостьПоНоменклатуре = Стр2.СтоимостьПоНоменклатуре;
						Область.Параметры.Номенклатура=Стр2.Номенклатура;
						ТД.Вывести(Область);
						СтараяНоменклатура = Стр2.Номенклатура;
					КонецЕсли;
				КонецЦикла;

				СтарыйДоговор = РезультатЗапроса.Ссылка;
			Иначе
			КонецЕсли;	
			
			
			//НовСтрока=ТабРезультат.Добавить();
			//НовСтрока.ОбеспечительныйВзнос=РезультатЗапроса.ОбеспечительныйВзнос;
			//НовСтрока.Ставка=РезультатЗапроса.Ставка;
			//НовСтрока.Контрагент=РезультатЗапроса.Контрагент;
			//НовСтрока.Договор=РезультатЗапроса.Договор;
			//НовСтрока.ДатаОкончанияСрокаАренды=РезультатЗапроса.ДатаОкончанияСрокаАренды;
			//НовСтрока.ДатаНачалаСрокаАренды=РезультатЗапроса.ДатаНачалаСрокаАренды;    
			//НовСтрока.ДатаАкта=РезультатЗапроса.ДатаАкта;           
			////НовСтрока.Организация=РезультатЗапроса.Организация;
			//НовСтрока.ВидДоговора=РезультатЗапроса.ВидДоговора;
			//НовСтрока.Комментарий=РезультатЗапроса.Комментарий;
			//НовСтрока.ПлощадьПоДоговору=РезультатЗапроса.ПлощадьПоДоговору;
			//НовСтрока.Номенклатура=РезультатЗапроса.Номенклатура;
			//НовСтрока.Валюта=РезультатЗапроса.Валюта;
			//НовСтрока.СтоимостьПоНоменклатуре=РезультатЗапроса.СтоимостьПоНоменклатуре;
			//НовСтрока.НазваниеБренд=РезультатЗапроса.НазваниеБренд;
			//НовСтрока.ИК=РезультатЗапроса.ИК;
			//НовСтрока.Профиль=РезультатЗапроса.Профиль;
			//НовСтрока.ОдностороннееРасторжениеСоСтороныАрендодателя=РезультатЗапроса.ОдностороннееРасторжениеСоСтороныАрендодателя;
			//НовСтрока.ОдностороннееРасторжениеСоСтороныАрендатора=РезультатЗапроса.ОдностороннееРасторжениеСоСтороныАрендатора;
			//НовСтрока.Организация=РезультатЗапроса.Организация;
			//НовСтрока.Индексация=РезультатЗапроса.Индексация;
			//НовСтрока.USD=РезультатЗапроса.USD;
			//НовСтрока.ЦенаКвМГод=РезультатЗапроса.ЦенаКвМГод;
			//НовСтрока.Номер=РезультатЗапроса.Номер;
			//НовСтрока.Ссылка=РезультатЗапроса.Ссылка;
			//НовСтрока.ФактическоеНачало=РезультатЗапроса.ФактическоеНачало;
			//НовСтрока.ФактическоеОкончание=РезультатЗапроса.ФактическоеОкончание;
			//
			//НовСтрока.СуммаЗалога=РезультатЗапроса.СуммаЗалога;
			
			
		КонецЦикла;	

		// Итого
		Область = Макет.ПолучитьОбласть("ШапкаИтого");
		Если Статус1 = "Текущие" Тогда
			Статус = "текущим договорам";
		ИначеЕсли Статус1 = "Заключенные" Тогда
			Статус = "заключенным договорам";
		Иначе
			Статус = "закрытым договорам";
		КонецЕсли;	
		Область.Параметры.Статус=Статус;
		ТД.Вывести(Область);
		Итого = Выгрузка.Скопировать();
	    Итого.Свернуть("ВидДоговора,ПлощадьПоДоговору","СтоимостьПоНоменклатуре");
		Итого.Свернуть("ВидДоговора","ПлощадьПоДоговору,СтоимостьПоНоменклатуре");
		Для Каждого Стр2 Из Итого Цикл
			Область = Макет.ПолучитьОбласть("СтрИтого");
			Область.Параметры.ВидДоговора = Стр2.ВидДоговора;
			Область.Параметры.СтоимостьПоНоменклатуре = Стр2.СтоимостьПоНоменклатуре;
			Область.Параметры.ПлощадьПоДоговору=Стр2.ПлощадьПоДоговору;
			ТД.Вывести(Область);
		КонецЦикла;
		
		// Итого2
		Область = Макет.ПолучитьОбласть("ШапкаИтого");
		Если Статус1 = "Текущие" Тогда
			Статус = "текущим договорам";
		ИначеЕсли Статус1 = "Заключенные" Тогда
			Статус = "заключенным договорам";
		Иначе
			Статус = "закрытым договорам";
		КонецЕсли;	
		Область.Параметры.Статус=Статус;
		ТД.Вывести(Область);
		
		СтараяНоменклатура = "";
		СтарыйВидДоговора = "";
		Итого2 = Выгрузка.Скопировать();
	    Итого2.Свернуть("ВидДоговора,Номенклатура,ПлощадьПоДоговору","СтоимостьПоНоменклатуре");
		Итого2.Свернуть("ВидДоговора,Номенклатура","ПлощадьПоДоговору,СтоимостьПоНоменклатуре");
		
		Итого3 = Итого2.Скопировать();
	    Итого3.Свернуть("ВидДоговора,ПлощадьПоДоговору","СтоимостьПоНоменклатуре");
		Итого3.Свернуть("ВидДоговора","ПлощадьПоДоговору,СтоимостьПоНоменклатуре");
		Итого3.Сортировать("ВидДоговора Возр");
		Для Каждого Стр3 Из Итого3 Цикл
			Если СтарыйВидДоговора <> Стр3.ВидДоговора Тогда
				Область = Макет.ПолучитьОбласть("СтрИтого");
				Область.Параметры.ВидДоговора = Стр3.ВидДоговора;
				Область.Параметры.СтоимостьПоНоменклатуре = Стр3.СтоимостьПоНоменклатуре;
				Область.Параметры.ПлощадьПоДоговору=Стр3.ПлощадьПоДоговору;
				ТД.Вывести(Область);
				
				Отбор = Новый Структура();
				Отбор.Вставить("ВидДоговора", Стр3.ВидДоговора);
				Таблица4 = Итого2.Скопировать(Отбор);
				Таблица4.Свернуть("Номенклатура","СтоимостьПоНоменклатуре");
				Для Каждого Стр4 Из Таблица4 Цикл
					Область = Макет.ПолучитьОбласть("СтрИтогоНом");
					Область.Параметры.Номенклатура = Стр4.Номенклатура;
					Область.Параметры.СтоимостьПоНоменклатуре = Стр4.СтоимостьПоНоменклатуре;
					ТД.Вывести(Область);
				КонецЦикла;	
				СтарыйВидДоговора = Стр2.ВидДоговора;
			КонецЕсли;	
		КонецЦикла;

	ТД.ФиксацияСверху = 4;	
	ТД.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТД.АвтоМасштаб = Истина;

	Элементы.ТД.ОтображениеСостояния.ДополнительныйРежимОтображения=ДополнительныйРежимОтображения.НеИспользовать;
	Элементы.ТД.ОтображениеСостояния.Видимость = ложь;

	
КонецПроцедуры

Функция Уровень(СтрокаДерева)
   Родитель=СтрокаДерева.Родитель;
   Возврат ?(Родитель=Неопределено, 0, 1+Уровень(Родитель));
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры
